---

C#Visual BasicVisual C++

Revit 2024 API
---
ElectricalAnalyticalNode..::..GetAnalyticalPropertyData Method
ElectricalAnalyticalNode Class See Also Send Feedback
---

Gets the electrical analytical node property data, nullNothingnullptra null reference (Nothing in Visual Basic) if not available.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023

# Syntax

C#
---

    public AnalyticalDistributionNodePropertyData GetAnalyticalPropertyData()

Visual Basic
---

    Public Function GetAnalyticalPropertyData As AnalyticalDistributionNodePropertyData

Visual C++
---

    public:
    AnalyticalDistributionNodePropertyData^ GetAnalyticalPropertyData()

#### Return Value

The electrical analytical node property data.

# Remarks

These types have special data:

  * Bus
  * TransferSwitch
  * EquipmentLoad

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace